# ConvertToPolygon

## Description
Converts object to polygon.

```pascal
FUNCTION ConvertToPolygon(
				h          : HANDLE;
				resolution : INTEGER) : HANDLE;
```

```python

def vs.ConvertToPolygon(h, resolution):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|resolution|INTEGER||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation